zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_fmc.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_fmc.c
  * @author  MCD Application Team
  * @brief   FMC Low Layer HAL module driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the Flexible Memory Controller (FMC) peripheral memories:
  *           + Initialization/de-initialization functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                        ##### FMC peripheral features #####
  ==============================================================================
  [..] The Flexible memory controller (FMC) includes following memory controllers:
       (+) The NOR/PSRAM memory controller
     (+) The NAND memory controller

  [..] The FMC functional block makes the interface with synchronous and asynchronous static
       memories. Its main purposes are:
       (+) to translate AHB transactions into the appropriate external device protocol
       (+) to meet the access time requirements of the external memory devices

  [..] All external memories share the addresses, data and control signals with the controller.
       Each external device is accessed by means of a unique Chip Select. The FMC performs
       only one access at a time to an external device.
       The main features of the FMC controller are the following:
        (+) Interface with static-memory mapped devices including:
           (++) Static random access memory (SRAM)
           (++) Read-only memory (ROM)
           (++) NOR Flash memory/OneNAND Flash memory
           (++) PSRAM (4 memory banks)
           (++) Two banks of NAND Flash memory with ECC hardware to check up to 8 Kbytes of
                data
        (+) Independent Chip Select control for each memory bank
        (+) Independent configuration for each memory bank

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */
#if ((defined HAL_NOR_MODULE_ENABLED || defined HAL_SRAM_MODULE_ENABLED) || defined HAL_NAND_MODULE_ENABLED )

/** @defgroup FMC_LL  FMC Low Layer
  * @brief FMC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/** @defgroup FMC_LL_Private_Constants FMC Low Layer Private Constants
  * @{
  */

/* ----------------------- FMC registers bit mask --------------------------- */

/* --- BCR Register ---*/
/* BCR register clear mask */

/* --- BTR Register ---*/
/* BTR register clear mask */
#define BTR_CLEAR_MASK    ((uint32_t)(FMC_BTRx_ADDSET | FMC_BTRx_ADDHLD  |\
                                      FMC_BTRx_DATAST | FMC_BTRx_BUSTURN |\
                                      FMC_BTRx_CLKDIV | FMC_BTRx_DATLAT  |\
                                      FMC_BTRx_ACCMOD | FMC_BTRx_DATAHLD))

/* --- BWTR Register ---*/
/* BWTR register clear mask */
#if defined(FMC_BWTRx_BUSTURN)
#define BWTR_CLEAR_MASK   ((uint32_t)(FMC_BWTRx_ADDSET | FMC_BWTRx_ADDHLD  |\
                                      FMC_BWTRx_DATAST | FMC_BWTRx_BUSTURN |\
                                      FMC_BWTRx_ACCMOD | FMC_BWTRx_DATAHLD))
#else
#define BWTR_CLEAR_MASK   ((uint32_t)(FMC_BWTRx_ADDSET | FMC_BWTRx_ADDHLD  |\
                                      FMC_BWTRx_DATAST | FMC_BWTRx_ACCMOD  |\
                                      FMC_BWTRx_DATAHLD))
#endif /* FMC_BWTRx_BUSTURN */

/* --- PCR Register ---*/
/* PCR register clear mask */
#define PCR_CLEAR_MASK    ((uint32_t)(FMC_PCR_PWAITEN | FMC_PCR_PBKEN  | \
                                      FMC_PCR_PWID    | FMC_PCR_ECCEN  | \
                                      FMC_PCR_TCLR    | FMC_PCR_TAR    | \
                                      FMC_PCR_ECCSS))
/* --- PMEM Register ---*/
/* PMEM register clear mask */
#define PMEM_CLEAR_MASK   ((uint32_t)(FMC_PMEM_MEMSET  | FMC_PMEM_MEMWAIT |\
                                      FMC_PMEM_MEMHOLD | FMC_PMEM_MEMHIZ))

/* --- PATT Register ---*/
/* PATT register clear mask */
#define PATT_CLEAR_MASK   ((uint32_t)(FMC_PATT_ATTSET  | FMC_PATT_ATTWAIT |\
                                      FMC_PATT_ATTHOLD | FMC_PATT_ATTHIZ))


/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup FMC_LL_Exported_Functions FMC Low Layer Exported Functions
  * @{
  */

/** @addtogroup FMC_LL_Exported_Functions RIF protection configuration
  *  @brief   RIF protection configuration functions
  *
@verbatim
  ==============================================================================
            ##### RIF protection configuration functions #####
  ==============================================================================
    [..]
    This subsection allows to get/set the RIF protection configuration made of
    security, privilege, and cid (compartment id) attributes.

@endverbatim
  * @{
  */

/**
  * @brief  Configure the RIF COMMON, NOR and NAND CID protection
  * @param  Item COMMON or NOR/PSRAM or NAND
  *           @arg FMC_COMMON (COMMON controller, FMC_CFGR)
  *           @arg FMC_NOR_PSRAM_1 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_2 (NOR/PSRAM controller for Chip Select NE2,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_3 (NOR/PSRAM controller for Chip Select NE3,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_4 (NOR/PSRAM controller for Chip Select NE4,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NAND (NAND controller, including registers and associated memory map region (4 Kbytes))
  * @param  Attributes RIF COMMON, NOR/PSRAM and NAND CID protection attribute
  *           @arg FMC_PRIV
  *           @arg FMC_NPRIV
  *           @arg FMC_SEC
  *           @arg FMC_NSEC
  *           @arg FMC_CID_DISABLE
  *           @arg FMC_CID_STATIC_0
  *           ...
  *           @arg FMC_CID_STATIC_3
  *           @arg FMC_CID_DYNAMIC_0
  *           ...
  *           @arg FMC_CID_DYNAMIC_3
  * @retval HAL_OK if the configuration is successfully set, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_FMC_ConfigAttributes(uint32_t Item, uint32_t Attributes)
{
  /* Check the parameters */
  assert_param(IS_FMC_ITEM_CID(Item));
  assert_param(IS_FMC_ATTRIBUTES_CID(Attributes));

