zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_fmc.c
  /* Configure PRIV attribute */
  if ((Attributes & FMC_PRIV_SELECT) == FMC_PRIV_SELECT)
  {
    if ((Attributes & FMC_PRIV) == FMC_PRIV)
    {
      FMC_Common_R->PRIVCFGR |= (1UL << Item);
    }
    else
    {
      FMC_Common_R->PRIVCFGR &= ~(1UL << Item);
    }
  }

  /* Configure SEC attribute */
  if ((Attributes & FMC_SEC_SELECT) == FMC_SEC_SELECT)
  {
    if ((Attributes & FMC_SEC) == FMC_SEC)
    {
      FMC_Common_R->SECCFGR |= (1UL << Item);
    }
    else
    {
      FMC_Common_R->SECCFGR &= ~(1UL << Item);
    }
  }

  /* Configure CID attribute */
  if (Item == FMC_COMMON)
  {
    FMC_Common_R->CIDCFGR0 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR0 |= (Attributes & FMC_CIDCFGR0_SCID_Msk) | FMC_CIDCFGR0_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR0 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR0_CFEN | FMC_CIDCFGR0_SEMEN;
    }
  }
  else if (Item == FMC_NOR_PSRAM_1)
  {
    FMC_Common_R->CIDCFGR1 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR1 |= (Attributes & FMC_CIDCFGR1_SCID_Msk) | FMC_CIDCFGR1_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR1 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR1_CFEN | FMC_CIDCFGR1_SEMEN;
    }
  }
  else if (Item == FMC_NOR_PSRAM_2)
  {
    FMC_Common_R->CIDCFGR2 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR2 |= (Attributes & FMC_CIDCFGR2_SCID_Msk) | FMC_CIDCFGR2_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR2 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR2_CFEN | FMC_CIDCFGR2_SEMEN;
    }
  }
  else if (Item == FMC_NOR_PSRAM_3)
  {
    FMC_Common_R->CIDCFGR3 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR3 |= (Attributes & FMC_CIDCFGR3_SCID_Msk) | FMC_CIDCFGR3_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR3 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR3_CFEN | FMC_CIDCFGR3_SEMEN;
    }
  }
  else if (Item == FMC_NOR_PSRAM_4)
  {
    FMC_Common_R->CIDCFGR4 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR4 |= (Attributes & FMC_CIDCFGR4_SCID_Msk) | FMC_CIDCFGR4_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR4 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR4_CFEN | FMC_CIDCFGR4_SEMEN;
    }
  }
  else if (Item == FMC_NAND)
  {
    FMC_Common_R->CIDCFGR5 = 0;  /* remove any CID filtering */
    /*if static CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_STATIC_SELECT)) == FMC_CID_STATIC_SELECT)
    {
      /* Write static CID configuration */
      FMC_Common_R->CIDCFGR5 |= (Attributes & FMC_CIDCFGR5_SCID_Msk) | FMC_CIDCFGR5_CFEN;
    }
    /*if shared CID field value is used ONLY and CID filtering is not disable */
    if ((Attributes & (FMC_CID_DISABLE | FMC_CID_DYNAMIC_SELECT)) == FMC_CID_DYNAMIC_SELECT)
    {
      /* Write shared CID configuration */
      FMC_Common_R->CIDCFGR5 |= (Attributes & FMC_CID_DYNAMIC_MASK) | FMC_CIDCFGR5_CFEN | FMC_CIDCFGR5_SEMEN;
    }
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the RIF COMMON, NOR and NAND CID protection
  * @param  Item COMMON or NOR/PSRAM or NAND
  *           @arg FMC_COMMON (COMMON controller, FMC_CFGR)
  *           @arg FMC_NOR_PSRAM_1 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_2 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_3 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_4 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NAND (NAND controller, including registers and associated memory map region (4 Kbytes))
  * @param  pAttributes RIF COMMON, NOR/PSRAM and NAND CID protection attribute
  *           @arg FMC_PRIV
  *           @arg FMC_NPRIV
  *           @arg FMC_SEC
  *           @arg FMC_NSEC
  *           @arg FMC_CID_DISABLE
  *           @arg FMC_CID_STATIC_0
  *           ...
  *           @arg FMC_CID_STATIC_3
  *           @arg FMC_CID_DYNAMIC_0
  *           ...
  *           @arg FMC_CID_DYNAMIC_3
  * @retval HAL_OK if the configuration is successfully read, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_FMC_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes)
{
  if (pAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_FMC_ITEM_CID(Item));

