zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_fmc.c
  *pAttributes = ((FMC_Common_R->PRIVCFGR & (1UL << Item)) == 0UL) ? FMC_NPRIV : FMC_PRIV;

  /* Get item security attribute */
  *pAttributes |= ((FMC_Common_R->SECCFGR & (1UL << Item)) == 0UL) ? FMC_NSEC : FMC_SEC;

  if (Item == FMC_COMMON)
  {
    /* Get item allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR0 & FMC_CIDCFGR0_CFEN_Msk) == FMC_CIDCFGR0_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR0 & FMC_CIDCFGR0_SEMEN_Msk) == FMC_CIDCFGR0_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR0)) &
                          (FMC_CIDCFGR0_SEMWLC2_Msk |
                           FMC_CIDCFGR0_SEMWLC1_Msk |
                           FMC_CIDCFGR0_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR0) & FMC_CIDCFGR0_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else if (Item == FMC_NOR_PSRAM_1)
  {
    /* Get item allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR1 & FMC_CIDCFGR1_CFEN_Msk) == FMC_CIDCFGR1_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR1 & FMC_CIDCFGR1_SEMEN_Msk) == FMC_CIDCFGR1_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR1)) &
                          (FMC_CIDCFGR1_SEMWLC2_Msk |
                           FMC_CIDCFGR1_SEMWLC1_Msk |
                           FMC_CIDCFGR1_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR1) & FMC_CIDCFGR1_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else if (Item == FMC_NOR_PSRAM_2)
  {
    /* Get item allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR2 & FMC_CIDCFGR2_CFEN_Msk) == FMC_CIDCFGR2_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR2 & FMC_CIDCFGR2_SEMEN_Msk) == FMC_CIDCFGR2_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR2)) &
                          (FMC_CIDCFGR2_SEMWLC2_Msk |
                           FMC_CIDCFGR2_SEMWLC1_Msk |
                           FMC_CIDCFGR2_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR2) & FMC_CIDCFGR2_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else if (Item == FMC_NOR_PSRAM_3)
  {
    /* Get item allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR3 & FMC_CIDCFGR3_CFEN_Msk) == FMC_CIDCFGR3_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR3 & FMC_CIDCFGR3_SEMEN_Msk) == FMC_CIDCFGR3_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR3)) &
                          (FMC_CIDCFGR3_SEMWLC2_Msk |
                           FMC_CIDCFGR3_SEMWLC1_Msk |
                           FMC_CIDCFGR3_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR3) & FMC_CIDCFGR3_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else if (Item == FMC_NOR_PSRAM_4)
  {
    /* Get item allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR4 & FMC_CIDCFGR4_CFEN_Msk) == FMC_CIDCFGR4_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR4 & FMC_CIDCFGR4_SEMEN_Msk) == FMC_CIDCFGR4_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR4)) &
                          (FMC_CIDCFGR4_SEMWLC2_Msk |
                           FMC_CIDCFGR4_SEMWLC1_Msk |
                           FMC_CIDCFGR4_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR4) & FMC_CIDCFGR4_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else if (Item == FMC_NAND)
  {
    /* Get channel allocated CID(s) */
    if ((FMC_Common_R->CIDCFGR5 & FMC_CIDCFGR5_CFEN_Msk) == FMC_CIDCFGR5_CFEN)
    {
      if ((FMC_Common_R->CIDCFGR5 & FMC_CIDCFGR5_SEMEN_Msk) == FMC_CIDCFGR5_SEMEN)
      {
        /* Get CIDs value from Semaphore white list */
        *pAttributes |= ((FMC_CID_DYNAMIC_SELECT) |
                         ((READ_REG(FMC_Common_R->CIDCFGR5)) &
                          (FMC_CIDCFGR5_SEMWLC2_Msk |
                           FMC_CIDCFGR5_SEMWLC1_Msk |
                           FMC_CIDCFGR5_SEMWLC0_Msk)));
      }
      else
      {
        /* Get CIDs value from Static CID field */
        *pAttributes |= (FMC_CID_STATIC_SELECT | (READ_REG(FMC_Common_R->CIDCFGR5) & FMC_CIDCFGR5_SCID_Msk));
      }
    }
    else
    {
      *pAttributes |= FMC_CID_DISABLE;
    }
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

/**
  * @brief  Attempt to acquire semaphore(s) of the RIF COMMON, NOR and NAND CID protection
  * @param  Item COMMON or NOR/PSRAM or NAND
  *           @arg FMC_COMMON (COMMON controller, FMC_CFGR)
  *           @arg FMC_NOR_PSRAM_1 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_2 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_3 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_4 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NAND (NAND controller, including registers and associated memory map region (4 Kbytes))
  * @retval HAL_OK if the configuration is successfully read, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_FMC_TakeSemaphore(uint32_t Item)
{
  uint32_t cidcurrent;

  /* Check the parameters */
  assert_param(IS_FMC_ITEM_CID(Item));

