zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_fmc.c
#if defined(CORE_CM0PLUS)
  cidcurrent = RIF_CID_CPU3_CM0;
#endif /* CORE_CM0PLUS */
#if defined(CORE_CM33)
  cidcurrent = RIF_CID_CPU2_CM33;
#endif /* CORE_CM33 */
#if defined(CORE_CA35)
  cidcurrent = RIF_CID_CPU1_CA35;
#endif /* CORE_CA35 */

  /* Take Semaphore */
  if (Item == FMC_COMMON)
  {
    FMC_Common_R->SEMCR0 |= FMC_SEMCR0_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR0 & FMC_SEMCR0_SEMCID_Msk) != (cidcurrent << FMC_SEMCR0_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else if (Item == FMC_NOR_PSRAM_1)
  {
    FMC_Common_R->SEMCR1 |= FMC_SEMCR1_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR1 & FMC_SEMCR1_SEMCID_Msk) != (cidcurrent << FMC_SEMCR1_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else if (Item == FMC_NOR_PSRAM_2)
  {
    FMC_Common_R->SEMCR2 |= FMC_SEMCR2_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR2 & FMC_SEMCR2_SEMCID_Msk) != (cidcurrent << FMC_SEMCR2_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else if (Item == FMC_NOR_PSRAM_3)
  {
    FMC_Common_R->SEMCR3 |= FMC_SEMCR3_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR3 & FMC_SEMCR3_SEMCID_Msk) != (cidcurrent << FMC_SEMCR3_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else if (Item == FMC_NOR_PSRAM_4)
  {
    FMC_Common_R->SEMCR4 |= FMC_SEMCR4_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR4 & FMC_SEMCR4_SEMCID_Msk) != (cidcurrent << FMC_SEMCR4_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else if (Item == FMC_NAND)
  {
    FMC_Common_R->SEMCR5 |= FMC_SEMCR5_SEM_MUTEX;

    if ((FMC_Common_R->SEMCR5 & FMC_SEMCR5_SEMCID_Msk) != (cidcurrent << FMC_SEMCR5_SEMCID_Pos))
    {
      /* Mutex not taken with current CID - it means that other authorized CID has control,
        previous acquired semaphore shall be released and status error is returned */
      (void)HAL_FMC_ReleaseSemaphore(Item);
      return HAL_ERROR;
    }
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}

/**
  * @brief  Release semaphore(s) of the RIF COMMON, NOR and NAND CID protection
  * @param  Item COMMON or NOR/PSRAM or NAND
  *           @arg FMC_COMMON (COMMON controller, FMC_CFGR)
  *           @arg FMC_NOR_PSRAM_1 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_2 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_3 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NOR_PSRAM_4 (NOR/PSRAM controller for Chip Select NE1,
                  including registers and associated memory map region (64 Mbytes))
  *           @arg FMC_NAND (NAND controller, including registers and associated memory map region (4 Kbytes))
  * @retval HAL_OK if the configuration is successfully read, HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_FMC_ReleaseSemaphore(uint32_t Item)
{
  /* Check the parameters */
  assert_param(IS_FMC_ITEM_CID(Item));

  /* Release Semaphore */
  if (Item == FMC_COMMON)
  {
    FMC_Common_R->SEMCR0 &= ~FMC_SEMCR0_SEM_MUTEX;
  }
  else if (Item == FMC_NOR_PSRAM_1)
  {
    FMC_Common_R->SEMCR1 &= ~FMC_SEMCR1_SEM_MUTEX;
  }
  else if (Item == FMC_NOR_PSRAM_2)
  {
    FMC_Common_R->SEMCR2 &= ~FMC_SEMCR2_SEM_MUTEX;
  }
  else if (Item == FMC_NOR_PSRAM_3)
  {
    FMC_Common_R->SEMCR3 &= ~FMC_SEMCR3_SEM_MUTEX;
  }
  else if (Item == FMC_NOR_PSRAM_4)
  {
    FMC_Common_R->SEMCR4 &= ~FMC_SEMCR4_SEM_MUTEX;
  }
  else if (Item == FMC_NAND)
  {
    FMC_Common_R->SEMCR5 &= ~FMC_SEMCR5_SEM_MUTEX;
  }
  else
  {
    /* Nothing to do */
  }

  return HAL_OK;
}


/** @defgroup FMC_LL_Exported_Functions_NORSRAM FMC Low Layer NOR SRAM Exported Functions
  * @brief  NORSRAM Controller functions
  *
  @verbatim
  ==============================================================================
                   ##### How to use NORSRAM device driver #####
  ==============================================================================

  [..]
    This driver contains a set of APIs to interface with the FMC NORSRAM banks in order
    to run the NORSRAM external devices.

    (+) FMC NORSRAM bank reset using the function FMC_NORSRAM_DeInit()
    (+) FMC NORSRAM bank control configuration using the function FMC_NORSRAM_Init()
    (+) FMC NORSRAM bank timing configuration using the function FMC_NORSRAM_Timing_Init()
    (+) FMC NORSRAM bank extended timing configuration using the function
        FMC_NORSRAM_Extended_Timing_Init()
    (+) FMC NORSRAM bank enable/disable write operation using the functions
        FMC_NORSRAM_WriteOperation_Enable()/FMC_NORSRAM_WriteOperation_Disable()

@endverbatim
  * @{
  */

/** @defgroup FMC_LL_NORSRAM_Exported_Functions_Group1 Initialization and de-initialization functions
  * @brief    Initialization and Configuration functions
  *
  @verbatim
  ==============================================================================
              ##### Initialization and de_initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the FMC NORSRAM interface
    (+) De-initialize the FMC NORSRAM interface
    (+) Configure the FMC clock and associated GPIOs

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the FMC_NORSRAM device according to the specified
  *         control parameters in the FMC_NORSRAM_InitTypeDef
  * @param  Device Pointer to NORSRAM device instance
  * @param  Init Pointer to NORSRAM Initialization structure
  * @retval HAL status
  */
HAL_StatusTypeDef  FMC_NORSRAM_Init(FMC_NORSRAM_TypeDef *Device, FMC_NORSRAM_InitTypeDef *Init)
{
  uint32_t flashaccess;
  uint32_t btcr_reg;
  uint32_t mask;

  /* Check the parameters */
  assert_param(IS_FMC_NORSRAM_DEVICE(Device));
  assert_param(IS_FMC_NORSRAM_BANK(Init->NSBank));
  assert_param(IS_FMC_MUX(Init->DataAddressMux));
  assert_param(IS_FMC_MEMORY(Init->MemoryType));
  assert_param(IS_FMC_NORSRAM_MEMORY_WIDTH(Init->MemoryDataWidth));
  assert_param(IS_FMC_BURSTMODE(Init->BurstAccessMode));
  assert_param(IS_FMC_WAIT_POLARITY(Init->WaitSignalPolarity));
  assert_param(IS_FMC_WAIT_SIGNAL_ACTIVE(Init->WaitSignalActive));
  assert_param(IS_FMC_WRITE_OPERATION(Init->WriteOperation));
  assert_param(IS_FMC_WAITE_SIGNAL(Init->WaitSignal));
  assert_param(IS_FMC_EXTENDED_MODE(Init->ExtendedMode));
  assert_param(IS_FMC_ASYNWAIT(Init->AsynchronousWait));
  assert_param(IS_FMC_WRITE_BURST(Init->WriteBurst));
  assert_param(IS_FMC_CONTINOUS_CLOCK(Init->ContinuousClock));
  assert_param(IS_FMC_PAGESIZE(Init->PageSize));
  assert_param(IS_FMC_NBL_SETUPTIME(Init->NBLSetupTime));

